Autodesk.Revit.DB.Plumbing.PipeSettings.SetFlowConvertionServerInfo(Autodesk.Revit.DB.MEPCalculationServerInfo)
Set the MEPServerInfo of the current plumbing flow convertion server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.GetFlowConvertionServerInfo
Get the MEPServerInfo of the current plumbing flow convertion server.
Returns:
The MEPServerInfo of the current plumbing flow convertion server.
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.IsValidSpecificFittingAngle(System.Double)
Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.
angle:
The angle value (in degree).
Returns:
True if the given value is a valid specific fitting angle.
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.IsAnalysisForClosedLoopHydronicPipingNetworksEnabled(Autodesk.Revit.DB.Document)
Indicates whether analysis for closed loop hydronic piping networks is enabled in the specified document.
ccda:
The document.
Returns:
Returns true if analysis for closed loop hydronic piping networks is enabled, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.GetSpecificFittingAngleStatus(System.Double)
Gets the status of given specific angle.
angle:
The specific fitting angle (in degree) that must be one of 90, 60, 45, 30, 22.5 or 11.25 degrees.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for angle must be 90, 60, 45, 30, 22.5 or 11.25 degrees.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipeSettings.SetSpecificFittingAngleStatus(System.Double,System.Boolean)
Sets the status of given specific angle.
angle:
The specific angle (in degree) that must be one of 60, 45, 30, 22.5 or 11.25 degrees.
bStatus:
Status, true - using the given angle during the pipe layout.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for angle must be 90, 60, 45, 30, 22.5 or 11.25 degrees.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Can not set an angle status for an invalid angle.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipeSettings.GetSpecificFittingAngles
Gets the list of specific fitting angles.
Remarks:
Revit will only use the angles specified during the pipe layout or modifying the pipe layout.
When laying out the pipes, if the angle between two pipes is close to the allowed angle,
the specific angle is used for that pipe fitting.
Returns:
Angles (in degrees).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipeSettings.AddPipeSlope(System.Double)
Add a pipe slope value.
slope:
The pipe slope value. Revit stores the slope value as a percentage (0-100).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for slope must be between 0 and 100. Slope value is stored in percentage. e.g. 100 means 100%, and it is 45 degree.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Can not add a pipe slope value that was already added.
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.SetPipeSlopes(System.Collections.Generic.IList{System.Double})
Set pipe slope values.
slopes:
Pipe slope values. Revit stores the slope value as a percentage (0-100).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Each value of the slopes must be between 0 and 100. Slope value is stored in percentage. e.g. 100 means 100%, and it is 45 degree.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation failed.
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.GetPipeSlopes
Get pipe slopes.
Returns:
Pipe slope values. Revit stores the slope value as a percentage (0-100).
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.GetPipeSettings(Autodesk.Revit.DB.Document)
Get the pipe settings of the project.
document:
The document.
Returns:
The pipe settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.AnalysisForClosedLoopHydronicPipingNetworks
Indicates whether to enable analysis for closed loop hydronic piping networks.
Remarks:
For closed loop hydronic piping networks, Revit can analyze flow and pressure values for supply and return loops. In the model, select a pump to see the results of the analysis in the Properties palette.
A closed loop hydronic piping network must contain:
A single pump/circulator
A single source, such as a boiler
Multiple piping segments
Multiple terminals, such as radiators.
A network may contain a direct return loop or a reverse return loop.
Since:
2018

Autodesk.Revit.DB.Plumbing.PipeSettings.UseAnnotationScaleForSingleLineFittings
Indicates whether use annotation scale for single line fittings or not.
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.FittingAnnotationSize
The value of fitting annotation size.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for dValue must be no more than 30000 feet in absolute value.
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.ConnectorTolerance
The connector tolerance value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for dValue is not finite
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.ConnectorSeparator
The connector separator string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.SizePrefix
The size prefix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.SizeSuffix
The size suffix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.FittingAngleUsage
Determine how to use fitting angle during pipe layout or modifying layout.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for fittingAngleUsage doesn't support in piping.
-or-
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Plumbing.PipeSettings.Centerline
The abbreviation of the Centerline (=) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Plumbing.PipeSettings.SetDownFromBottom
The abbreviation of the Set Down from bottom of fitting (SDB) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Plumbing.PipeSettings.SetUpFromBottom
The abbreviation of the Set Up from bottom of fitting(SUB) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Plumbing.PipeSettings.SetDown
The abbreviation of the Set Down (SD) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Plumbing.PipeSettings.SetUp
The abbreviation of the Set Up (SU) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Plumbing.PipeSettings.FlatOnBottom
The abbreviation of the Flat On Bottom (FOB) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Plumbing.PipeSettings.FlatOnTop
The abbreviation of the Flat On Top (FOT) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Plumbing.PipeSettings
The pipe setting class.
Since:
2012